-- COURSE PROJECT INIT
/*
Курсовая работа по Базам данных.
Тема курсовой которую выбрал: система работы для склада с заказами на поставку продукции.
- Склад заводит контрагента
- Делает заявку на контрагента
- Контрагент подтверждает заявку на поставку
- Склад ожидает поставщика и принимает поставку

Таблицы
- Пользователи
- Должности
- Склады
- Контрагенты
- Транспорт
- Категории товаров
- Заявки
- Номенклатура товаров

Требования к курсовому проекту

1. общее текстовое описание БД и решаемых ею задач
2. минимальное количество таблиц - 10
3. скрипты создания структуры БД (с первичными ключами, индексами, внешними ключами)
4. скрипты наполнения БД данными
5. скрипты характерных выборок (включающие группировки, JOIN'ы, вложенные таблицы)
6. представления (минимум 2)
7. хранимые процедуры / триггеры
8. ...

 */

